Repository: jweiland-net/weather2
Catalog: Resources/Private/Language/*.locallang_scheduler_openweatherapi.xlf
Languages: de

# city
source: City name
de: Stadtname

source: Country
de: Land

# languages
source: Language IDs (comma separated list with IDs)
de: Sprach IDs (kommaseparierte Liste mit IDs)

# clear_cache
source: Clear cache for pages (comma separated list with IDs)
de: Leere Cache für Seiten (kommaseparierte Liste mit IDs)

# mail_config
source: TYPO3 Mail configuration
de: TYPO3 Mail Konfiguration

# record_storage_page
source: Record storage page (optional)
de: Speicherort des Datensatzes (Optional)

# error_notification
source: Notify via mail if task was not successful
de: E-Mail Benachrichtigung bei Fehlern

# email_sendername
source: Mail notification sender name
de: Absendername für E-Mail Benachrichtigung

# email_sender
source: Mail notification sender E-Mail
de: Absenderadresse für E-Mail Benachrichtigung

# placeholder.email_sendername
source: default:
de: standard:

# placeholder.email_sender
source: default:
de: standard:

# placeholder.record_storage_page
source: click on the button and select a page
de: klicke auf den Button und wähle eine Seite aus

# buttons.record_storage_page
source: Select
de: Auswählen

# email_receiver
source: Mail notification receiver E-Mail
de: Empfängeradresse für E-Mail Benachrichtigung

# message.mail_configuration.notice
source: You can change the mail configuration via the TYPO3 Install Tool > All configuration > Mail.
de: Die Mail-Konfiguration kann im TYPO3 Install Tool unter dem Punkt All configuration > Mail bearbeitet werden.

# message.api_code_200
source: API request successfully. API will use measure data from %s, %s.
de: API-Anfrage erfolgreich. Station %s, %s wird verwendet.

# message.api_code_404
source: API returns code 404, please check the city name!
de: Die API gab Code 404 zurück. Bitte überprüfe den Stadtname!

# message.api_code_none
source: API returns no status code. Return value of API-request was %s
de: Die API gab keinen Status-Code zurück. Inhalt der Antwort: %s

# message.api_response_null
source: API request failed. Please check your internet connection and try again later!
de: Die Anfrage schlug fehl. Bitte die Internetverbindung überprüfen und später erneut versuchen!

# message.api_response_401
source: Got Error 401 while API request. Please check your API-Key.
de: Die Anfrage gab Fehlercode 401 zurück. Bitte API-Key überprüfen.
